---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures
source: html/8f72d552-0b22-732d-462e-dfb39606d451.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures

Failures applicable to different mechanical, electrical and piping Elements.

## Syntax (C#)
```csharp
public static class GenericMEPFailures
```